
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.Скидки.Записывать = Истина;
	Для Каждого ТекСтрокаУслуги Из Услуги Цикл
		Движение = Движения.Скидки.Добавить();
		Движение.Период = Дата;
		Движение.Услуга = ТекСтрокаУслуги.Услуга;
		Движение.ИностранныйВС = ТекСтрокаУслуги.ИностранныйВС;
		Движение.Авиакомпания = Авиакомпания;
		Движение.РейсОтправления = РейсОтправления;
		Движение.Процент = ТекСтрокаУслуги.Скидка;
		Движение.Основание = Основание;
		Движение.ДействителенДо = ДействителенДо;
	КонецЦикла;
КонецПроцедуры
