
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ДанныеПрилетов.Записывать = Истина;
	Движение = Движения.ДанныеПрилетов.Добавить();
	Движение.Период = Дата;
	Движение.Дата = Дата(Дата);
	Движение.Рейс = Рейс;
	Движение.ПассажирыВзрослые = ПассажирыВзрослые;
	Движение.ПассажирыДети = ПассажирыДети;
	Движение.ПассажирыМалыши = ПассажирыМалыши;
	Движение.РучнаяКладь = РучнаяКладь;
	Движение.Багаж = Багаж;
	Движение.Почта = Почта;
	Движение.Груз = Груз;
	Движение.ВылетИзКпПлан = ВылетИзКпПлан;
	Движение.ВылетИзКпФакт = ВылетИзКпФакт;
	Движение.ПрибытиеПлан = ПрибытиеПлан;
	Движение.ПрибытиеФакт = ПрибытиеФакт;
	Движение.ПрибытиеРасчет = ПрибытиеРасчет;
	Движение.УходНаЗапаснойАП = УходНаЗапаснойАП;
	Движение.ЗапаснойАП = ЗапаснойАП;
	Движение.ПрибытиеНаЗапаснойАП = ПрибытиеНаЗапаснойАП;
	Движение.Регулярность = Регулярность;
	Движение.Примечание = Примечание;
	Движение.НомерБорта = НомерБорта;
	Движение.ТипВС = ТипВС;
	Движение.АэропортВылета = АэропортВылета;
	Движение.АэропортПрилета = АэропортПрилета;
	Движение.ЗадержкаПрилета = ЗадержкаПрилета;
	Движение.Неприбыл = Неприбыл;
	Движение.ПричинаЗадержки = ПричинаЗадержки;
	Движение.ПричинаНеприбытия = ПричинаНеприбытия;
КонецПроцедуры

