
&НаКлиенте
Процедура Печать(Команда)
	
	Док = ПечатьСервер(Количество);
	Док.Показать();
	
КонецПроцедуры

&НаСервере
Функция ПечатьСервер(КоличествоЭкз)
	
	Схема = Отчеты.СуточныйПлан.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	 Если КлючТекущегоВарианта = "Завтра" тогда
	 	Настройки = Схема.ВариантыНастроек.Завтра.Настройки;	
	 ИначеЕсли КлючТекущегоВарианта = "Сегодня" тогда
 	 	Настройки = Схема.ВариантыНастроек.Сегодня.Настройки;
     КонецЕсли;
	 КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных();
	 КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);

	 Настройки = КомпоновщикНастроек.Настройки;

	 КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	 МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки);
	 ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	 ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	 ДокументРезультат = Новый ТабличныйДокумент;
	 ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	 ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	 ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);

	 ДокументРезультат.ОтображатьЗаголовки = Ложь;
	 ДокументРезультат.ОтображатьСетку = Ложь;
	 ДокументРезультат.АвтоМасштаб = Истина;
	 
	 Высота1Табл = ДокументРезультат.ВысотаТаблицы;
	 ОстатокСтраницы = 59;
	 
	ТабДок = новый ТабличныйДокумент;
	Для Экз = 1 по КоличествоЭкз Цикл 
		Если ОстатокСтраницы < Высота1Табл Тогда 
			//новая страница
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			ОстатокСтраницы = 59;
		КонецЕсли;	
		ТабДок.Вывести(ДокументРезультат);
		ПустойМакет = Отчеты.СуточныйПлан.ПолучитьМакет("ДляПустойСтроки");
		ПустаяОбласть = ПустойМакет.ПолучитьОбласть("ПустаяОбласть");
		ТабДок.Вывести(ПустаяОбласть);

		ОстатокСтраницы = ОстатокСтраницы - Высота1Табл;
	КонецЦикла;
		
	Возврат ТабДок;
	
КонецФункции	
