Процедура ОбработкаПроведения(Отказ, Режим)
	//// регистр Ответственные 
	
	Движения.ОтветственныеФормаС.Записывать = Истина;
	Движение = Движения.ОтветственныеФормаС.Добавить();
	Движение.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	Движение.Документ = Ссылка;
	Движение.Дата = ТекущаяДата();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СоздателиФормаС.Документ КАК Документ
	|ИЗ
	|	РегистрСведений.СоздателиФормаС КАК СоздателиФормаС
	|ГДЕ
	|	СоздателиФормаС.Документ = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка );
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда 
		движения.СоздателиФормаС.Записывать = Истина;
		Движение = Движения.СоздателиФормаС.Добавить();
		Движение.Пользователь = ПараметрыСеанса.ТекущийПользователь;
		Движение.Документ = Ссылка;
		Движение.Дата = ТекущаяДата();	
	КонецЕсли;
	
	// регистр ДанныеФормС 
	
	Движения.ДанныеФормС.Записывать = Истина;
	Для Каждого ТекСтрокаУслуги Из Услуги Цикл
		Движение = Движения.ДанныеФормС.Добавить();
		Движение.Период = Дата;
		Движение.РейсОтправления = РейсОтправления;
		Движение.ВладелецВС = ВладелецВС;
		Движение.Плательщик = Плательщик;
		Движение.Услуга = ТекСтрокаУслуги.Услуга;
		Движение.Количество = ТекСтрокаУслуги.Количество;
		Движение.Цена = ТекСтрокаУслуги.Цена;
		Движение.Сумма = ТекСтрокаУслуги.Сумма;
		Движение.НДС = ТекСтрокаУслуги.НДС;
		Движение.Скидка = ТекСтрокаУслуги.Скидка;
		Движение.НомерБорта = НомерБорта;
		Движение.КурсВалюты = КурсВалюты;
		Движение.Основание = ТекСтрокаУслуги.Основание;
		Движение.ТипВС = ТипВС;
	КонецЦикла;
КонецПроцедуры
