
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.Цены.Записывать = Истина;
	Для Каждого ТекСтрокаУслуги Из Услуги Цикл
		Движение = Движения.Цены.Добавить();
		Движение.Период = Дата;
		Движение.Услуга = ТекСтрокаУслуги.Услуга;
		Движение.ИностранныйВС = ТекСтрокаУслуги.ИностранныйВС;
		Движение.МассаЛ = ТекСтрокаУслуги.МассаЛ;
		Движение.МассаП = ТекСтрокаУслуги.МассаП;
		Движение.ТипВС = ТекСтрокаУслуги.ТипВС;
		Движение.Цена = ТекСтрокаУслуги.Цена;
		Движение.Основание = Основание;
		Движение.ДействителенДо = ДействителенДо;
		Движение.Валюта = ТекСтрокаУслуги.Валюта;
		Движение.ЭтоВертолет = ТекСтрокаУслуги.ЭтоВертолет;
	КонецЦикла;
КонецПроцедуры
	